In [1]:
import pandas as pd
import numpy as np
import datetime as dt
pd.set_option("display.max_columns",None)
pd.set_option("display.float_format",lambda x: '%.3f' % x)

df_ = pd.read_excel("online_retail_II.xlsx",sheet_name="Year 2009-2010")
df_.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.950,13085.000,United Kingdom
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.100,13085.000,United Kingdom
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.250,13085.000,United Kingdom

In [79]:
df = df_.copy()

In [62]:
df = df.dropna()

In [63]:
df["Invoice"].astype(str).str.contains("C")

0         False
1         False
2         False
3         False
4         False
          ...
525456    False
525457    False
525458    False
525459    False
525460    False
Name: Invoice, Length: 417534, dtype: bool

In [64]:
df["Invoice"].str.contains("C",na=False)

0         False
1         False
2         False
3         False
4         False
          ...
525456    False
525457    False
525458    False
525459    False
525460    False
Name: Invoice, Length: 417534, dtype: bool

In [65]:
df["Invoice"].str.extract('([A-Za-z]+)').isin(["C"])

            0
0       False
1       False
2       False
3       False
4       False
...       ...
525456  False
525457  False
525458  False
525459  False
525460  False

[417534 rows x 1 columns]

In [66]:
df.groupby("Description")[["Quantity"]].sum().sort_values(by="Quantity",ascending =False)

                                     Quantity
Description
WHITE HANGING HEART T-LIGHT HOLDER      55861
WORLD WAR 2 GLIDERS ASSTD DESIGNS       54274
BROCADE RING PURSE                      47430
PACK OF 72 RETRO SPOT CAKE CASES        44507
ASSORTED COLOUR BIRD ORNAMENT           44120
...                                       ...
TREE OF NOAH FESTIVE SCENTED CANDLE       -34
LARGE RED RETROSPOT WINDMILL              -64
SILVER CHERRY LIGHTS                      -96
WHITE CHERRY LIGHTS                       -97
Discount                                -1675

[4459 rows x 1 columns]

In [67]:
df["Description"].value_counts()

Description
WHITE HANGING HEART T-LIGHT HOLDER    3245
REGENCY CAKESTAND 3 TIER              1872
STRAWBERRY CERAMIC TRINKET BOX        1536
ASSORTED COLOUR BIRD ORNAMENT         1376
HOME BUILDING BLOCK WORD              1229
                                      ...
BLUE OWL DECORATION                      1
PINK OWL DECORATION                      1
IVORY WALL CLOCK                         1
RED WALL CLOCK                           1
BAKING MOULD EASTER EGG MILK CHOC        1
Name: count, Length: 4459, dtype: int64

In [68]:
df["Totalprice"] = df["Quantity"] * df["Price"]
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,Totalprice
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.950,13085.000,United Kingdom,83.400
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom,81.000
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom,81.000
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.100,13085.000,United Kingdom,100.800
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.250,13085.000,United Kingdom,30.000

In [69]:
df.groupby("Invoice").agg({"Totalprice":"sum"})

         Totalprice
Invoice
489434      505.300
489435      145.800
489436      630.330
489437      310.750
489438     2286.240
...             ...
C538121     -12.750
C538122      -1.250
C538123      -7.500
C538124     -17.700
C538164      -1.950

[23587 rows x 1 columns]

In [70]:
df.describe()

,Quantity,InvoiceDate,Price,Customer ID,Totalprice
count,417534.000,417534,417534.000,417534.000,417534.000
mean,12.759,2010-07-01 01:12:19.787609856,3.888,15360.645,19.994
min,-9360.000,2009-12-01 07:45:00,0.000,12346.000,-25111.090
25%,2.000,2010-03-26 11:26:00,1.250,13983.000,4.250
50%,4.000,2010-07-08 19:12:00,1.950,15311.000,11.250
75%,12.000,2010-10-14 14:08:00,3.750,16799.000,19.350
max,19152.000,2010-12-09 20:01:00,25111.090,18287.000,15818.400
std,101.220,NaN,71.132,1680.811,99.916

In [71]:
df=df[~(df["Invoice"].str.contains("C",na=False))]

In [72]:
df.describe()

,Quantity,InvoiceDate,Price,Customer ID,Totalprice
count,407695.000,407695,407695.000,407695.000,407695.000
mean,13.587,2010-07-01 10:10:10.782177792,3.294,15368.504,21.663
min,1.000,2009-12-01 07:45:00,0.000,12346.000,0.000
25%,2.000,2010-03-26 14:01:00,1.250,13997.000,4.950
50%,5.000,2010-07-09 15:46:00,1.950,15321.000,11.900
75%,12.000,2010-10-14 17:09:00,3.750,16812.000,19.500
max,19152.000,2010-12-09 20:01:00,10953.500,18287.000,15818.400
std,96.842,NaN,34.757,1679.796,77.147

In [73]:
df["InvoiceDate"].max()

Timestamp('2010-12-09 20:01:00')

In [76]:
today_date = dt.datetime(2010, 12, 11)

In [77]:
rfm=df.groupby("Customer ID").agg({'InvoiceDate': lambda InvoiceDate: (today_date - InvoiceDate.max()).days,
                               "Invoice":lambda x:x.nunique(),
                               "Totalprice":lambda x: x.sum()}
                              );rfm.index=rfm.index.astype(int);rfm

             InvoiceDate  Invoice  Totalprice
Customer ID
12346                165       11     372.860
12347                  3        2    1323.320
12348                 74        1     222.160
12349                 43        3    2671.140
12351                 11        1     300.930
...                  ...      ...         ...
18283                 18        6     641.770
18284                 67        1     461.680
18285                296        1     427.000
18286                112        2    1296.430
18287                 18        4    2345.710

[4314 rows x 3 columns]

In [83]:
rfm.columns= ["recency","frequency","monetary"]
rfm=rfm[rfm["monetary"]>0]

In [84]:
rfm

             recency  frequency  monetary
Customer ID
12346            165         11   372.860
12347              3          2  1323.320
12348             74          1   222.160
12349             43          3  2671.140
12351             11          1   300.930
...              ...        ...       ...
18283             18          6   641.770
18284             67          1   461.680
18285            296          1   427.000
18286            112          2  1296.430
18287             18          4  2345.710

[4312 rows x 3 columns]

In [85]:
rfm.describe()

       recency  frequency   monetary
count 4312.000   4312.000   4312.000
mean    91.173      4.456   2048.238
std     96.861      8.170   8914.481
min      1.000      1.000      2.950
25%     18.000      1.000    307.988
50%     53.000      2.000    706.020
75%    136.000      5.000   1723.142
max    374.000    205.000 349164.350

In [86]:
rfm.loc[:,"recency_score"] =pd.qcut(rfm["recency"],q=5,labels=[5,4,3,2,1])

C:\Users\oskar\AppData\Local\Temp\ipykernel_17764\2339476000.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  rfm.loc[:,"recency_score"] =pd.qcut(rfm["recency"],q=5,labels=[5,4,3,2,1])

In [87]:
rfm

             recency  frequency  monetary recency_score
Customer ID
12346            165         11   372.860             2
12347              3          2  1323.320             5
12348             74          1   222.160             2
12349             43          3  2671.140             3
12351             11          1   300.930             5
...              ...        ...       ...           ...
18283             18          6   641.770             4
18284             67          1   461.680             3
18285            296          1   427.000             1
18286            112          2  1296.430             2
18287             18          4  2345.710             4

[4312 rows x 4 columns]

In [93]:
rfm.loc[:,"monetary_score"] =pd.qcut(rfm["monetary"],q=5,labels=[1,2,3,4,5])

In [94]:
rfm.loc[:,"frequency_score"]=pd.qcut(rfm["frequency"].rank(method="first"),q=5,labels=[1,2,3,4,5])

In [95]:
rfm

,recency,frequency,monetary,recency_score,monetary_score,frequency_score
Customer ID,,,,,,
12346,165,11,372.860,2,2,5
12347,3,2,1323.320,5,4,2
12348,74,1,222.160,2,1,1
12349,43,3,2671.140,3,5,3
12351,11,1,300.930,5,2,1
...,...,...,...,...,...,...
18283,18,6,641.770,4,3,5
18284,67,1,461.680,3,2,2
18285,296,1,427.000,1,2,2
18286,112,2,1296.430,2,4,3
18287,18,4,2345.710,4,5,4

In [100]:
rfm.loc[:,"rfm_score"] =rfm["recency_score"].astype(str) + rfm["frequency_score"].astype(str)
rfm

,recency,frequency,monetary,recency_score,monetary_score,frequency_score,rfm_score
Customer ID,,,,,,,
12346,165,11,372.860,2,2,5,25
12347,3,2,1323.320,5,4,2,52
12348,74,1,222.160,2,1,1,21
12349,43,3,2671.140,3,5,3,33
12351,11,1,300.930,5,2,1,51
...,...,...,...,...,...,...,...
18283,18,6,641.770,4,3,5,45
18284,67,1,461.680,3,2,2,32
18285,296,1,427.000,1,2,2,12
18286,112,2,1296.430,2,4,3,23
18287,18,4,2345.710,4,5,4,44

In [102]:
rfm.loc[rfm["rfm_score"]=="55"]

,recency,frequency,monetary,recency_score,monetary_score,frequency_score,rfm_score
Customer ID,,,,,,,
12415,11,7,19543.840,5,5,5,55
12431,9,13,4370.520,5,5,5,55
12471,10,49,20139.740,5,5,5,55
12472,5,13,11308.480,5,5,5,55
12474,14,13,5048.660,5,5,5,55
...,...,...,...,...,...,...,...
18225,1,15,7545.140,5,5,5,55
18226,14,15,6650.830,5,5,5,55
18229,2,10,3526.810,5,5,5,55
18245,15,13,3757.920,5,5,5,55
18260,10,17,7318.910,5,5,5,55

In [103]:
rfm.loc[rfm["rfm_score"]=="11"]

,recency,frequency,monetary,recency_score,monetary_score,frequency_score,rfm_score
Customer ID,,,,,,,
12355,203,1,488.210,1,2,1,11
12362,374,1,130.000,1,1,1,11
12366,269,1,500.240,1,2,1,11
12368,264,1,917.700,1,3,1,11
12378,198,1,1407.700,1,4,1,11
...,...,...,...,...,...,...,...
15928,292,1,293.530,1,2,1,11
15929,280,1,594.000,1,3,1,11
15941,273,1,405.000,1,2,1,11
15954,225,1,190.750,1,1,1,11
15964,299,1,272.960,1,2,1,11

In [104]:
seg_map = {
    r'[1-2][1-2]':"hibernating",
    r'[1-2][3-4]':"at_risk",
    r'[1-2]5':"cant_loose",
    r'3[1-2]':"about_to_sleep",
    r'33':"need_attention",
    r'[3-4][4-5]':"loyal_customers",
    r'41':"promising",
    r'51':"new_customers",
    r'[4-5][2-3]':"potential_loyalists",
    r'5[4-5]':"champions"
}

In [105]:
rfm["rfm_score"].replace(seg_map,regex=True)

Customer ID
12346             cant_loose
12347    potential_loyalists
12348            hibernating
12349         need_attention
12351          new_customers
                ...
18283        loyal_customers
18284         about_to_sleep
18285            hibernating
18286                at_risk
18287        loyal_customers
Name: rfm_score, Length: 4312, dtype: object

In [107]:
rfm.loc[:,"segment"] = rfm["rfm_score"].replace(seg_map,regex=True)
rfm

,recency,frequency,monetary,recency_score,monetary_score,frequency_score,rfm_score,segment
Customer ID,,,,,,,,
12346,165,11,372.860,2,2,5,25,cant_loose
12347,3,2,1323.320,5,4,2,52,potential_loyalists
12348,74,1,222.160,2,1,1,21,hibernating
12349,43,3,2671.140,3,5,3,33,need_attention
12351,11,1,300.930,5,2,1,51,new_customers
...,...,...,...,...,...,...,...,...
18283,18,6,641.770,4,3,5,45,loyal_customers
18284,67,1,461.680,3,2,2,32,about_to_sleep
18285,296,1,427.000,1,2,2,12,hibernating
18286,112,2,1296.430,2,4,3,23,at_risk
18287,18,4,2345.710,4,5,4,44,loyal_customers

In [109]:
rfm.groupby("segment")[["recency","frequency","monetary"]].agg(["mean","count"])

                    recency       frequency       monetary
                       mean count      mean count     mean count
segment
about_to_sleep       53.819   343     1.201   343  441.320   343
at_risk             152.159   611     3.074   611 1188.878   611
cant_loose          124.117    77     9.117    77 4099.450    77
champions             7.119   663    12.554   663 6852.264   663
hibernating         213.886  1015     1.126  1015  403.978  1015
loyal_customers      36.287   742     6.830   742 2746.067   742
need_attention       53.266   207     2.449   207 1060.357   207
new_customers         8.580    50     1.000    50  386.199    50
potential_loyalists  18.793   517     2.017   517  729.511   517
promising            25.747    87     1.000    87  367.087    87

In [111]:
rfm[["segment","recency","frequency","monetary"]].groupby("segment").agg(["mean","count"])

                    recency       frequency       monetary
                       mean count      mean count     mean count
segment
about_to_sleep       53.819   343     1.201   343  441.320   343
at_risk             152.159   611     3.074   611 1188.878   611
cant_loose          124.117    77     9.117    77 4099.450    77
champions             7.119   663    12.554   663 6852.264   663
hibernating         213.886  1015     1.126  1015  403.978  1015
loyal_customers      36.287   742     6.830   742 2746.067   742
need_attention       53.266   207     2.449   207 1060.357   207
new_customers         8.580    50     1.000    50  386.199    50
potential_loyalists  18.793   517     2.017   517  729.511   517
promising            25.747    87     1.000    87  367.087    87

In [115]:
rfm[rfm["segment"]=="cant_loose"].index

Index([12346, 12380, 12482, 12510, 12891, 12932, 13044, 13313, 13680, 13782,
       13799, 13856, 14025, 14063, 14160, 14221, 14548, 14607, 14685, 14745,
       15003, 15013, 15015, 15125, 15141, 15222, 15306, 15321, 15359, 15369,
       15372, 15443, 15538, 15607, 15633, 15722, 15751, 15754, 15768, 15911,
       15912, 16027, 16032, 16158, 16177, 16197, 16335, 16467, 16631, 16742,
       16743, 16875, 16986, 17021, 17032, 17092, 17113, 17157, 17188, 17230,
       17268, 17426, 17448, 17454, 17512, 17578, 17602, 17651, 17940, 17969,
       17988, 18009, 18051, 18064, 18094, 18251, 18258],
      dtype='int32', name='Customer ID')

In [120]:
new_df = pd.DataFrame()
new_df["new_custormer_id"] = rfm[rfm["segment"]=="new_customers"].index

In [122]:
new_df.head()

   new_custormer_id
0             12351
1             12385
2             12386
3             12427
4             12441

In [56]:
df.head()

,Invoice,StockCode,Description,Quantity,InvoiceDate,Price,Customer ID,Country,total_price
0,489434,85048,15CM CHRISTMAS GLASS BALL 20 LIGHTS,12,2009-12-01 07:45:00,6.950,13085.000,United Kingdom,83.400
1,489434,79323P,PINK CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom,81.000
2,489434,79323W,WHITE CHERRY LIGHTS,12,2009-12-01 07:45:00,6.750,13085.000,United Kingdom,81.000
3,489434,22041,"RECORD FRAME 7"" SINGLE SIZE",48,2009-12-01 07:45:00,2.100,13085.000,United Kingdom,100.800
4,489434,21232,STRAWBERRY CERAMIC TRINKET BOX,24,2009-12-01 07:45:00,1.250,13085.000,United Kingdom,30.000

In [100]:
def  create_rfm(df,csv=False):
    
    df.dropna(inplace=True)
    df=df[~df["Invoice"].str.contains("C",na=False)]
    df.loc[:,"total_price"] = df["Quantity"] * df["Price"]
    today_date = dt.datetime(2010,12,11)
    rfm = df.groupby("Customer ID").agg({"InvoiceDate":lambda date: (today_date-date.max()).days,
                                        "Invoice":lambda invoice: invoice.nunique(),
                                        "total_price":lambda x:x.sum()})

    rfm=rfm[rfm.total_price>0]
    rfm.columns = ["recency","frequency","monetary"]
    rfm.loc[:,"recency_score"]= pd.qcut(rfm["recency"],q=5,labels=[5,4,3,2,1])
    rfm.loc[:,"monetary_score"]= pd.qcut(rfm["monetary"],q=5,labels=[1,2,3,4,5])
    rfm.loc[:,"frequency_score"]=pd.qcut(rfm["frequency"].rank(method="first"),q=5,labels=[1,2,3,4,5])
    rfm.loc[:,"segment"] = rfm["recency_score"].astype(str) + rfm["frequency_score"].astype(str)
    seg_map = {
        r'[1-2][1-2]':"hibernating",
        r'[1-2][3-4]':"at_risk",
        r'[1-2]5':"cant_loose",
        r'3[1-2]':"about_to_sleep",
        r'33':"need_attention",
        r'[3-4][4-5]':"loyal_customers",
        r'41':"promising",
        r'51':"new_customers",
        r'[4-5][2-3]':"potential_loyalists",
        r'5[4-5]':"champions"
    }

    rfm.loc[:,"segment"]=rfm["segment"].replace(seg_map,regex=True)
    rfm = rfm[["recency","frequency","monetary","segment"]]
    rfm.index = rfm.index.astype(int)
    
    if csv:
        rfm.to_csv("rfm.csv")
    
    return rfm

In [101]:
df2 = df.copy()

rfm=create_rfm(df2,csv=True)

C:\Users\oskar\AppData\Local\Temp\ipykernel_12828\1155702706.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[:,"total_price"] = df["Quantity"] * df["Price"]

In [102]:
rfm

             recency  frequency  monetary              segment
Customer ID
12346            165         11   372.860           cant_loose
12347              3          2  1323.320  potential_loyalists
12348             74          1   222.160          hibernating
12349             43          3  2671.140       need_attention
12351             11          1   300.930        new_customers
...              ...        ...       ...                  ...
18283             18          6   641.770      loyal_customers
18284             67          1   461.680       about_to_sleep
18285            296          1   427.000          hibernating
18286            112          2  1296.430              at_risk
18287             18          4  2345.710      loyal_customers

[4312 rows x 4 columns]